Repository: huixiangyang/arc-kit
Catalog: Sources/Features/Finder/Runtime/Resources/Localization/FinderActions.xcstrings
Source language: en
Languages: zh_hans

# admission.action.already.accepted
source: This action was already accepted and its result may be unknown. Check your files first; it will not run again automatically.
zh_hans: 此动作已经接收，执行结果可能未知；请先核对文件，不会自动重复执行

# admission.too.many.finder.operations.retry.later
source: Too many Finder operations. Try again later.
zh_hans: Finder 操作过于频繁，请稍后再试

# agent.finder.action.already.running.try
source: A Finder action is already running. Try again later.
zh_hans: 已有 Finder 动作正在执行，请稍后重试

# agent.invalid.finder.command.data
source: Invalid Finder command data: %1$@
zh_hans: Finder 命令数据无效：%1$@

# agent.too.many.menu.requests.retry.later
source: Too many menu requests. Try again later.
zh_hans: 菜单请求过多，请稍后重试

# archive.cleanupFailed
source: Cannot clean temporary archive copies: %1$@; %2$@
zh_hans: 无法清理压缩临时副本：%1$@；%2$@

# clipboard.clipboard.executor.received.unexpected.command
source: Clipboard executor received an unexpected command: %1$@
zh_hans: 剪贴板执行器收到错误命令：%1$@

# clipboard.modified
source: Modified: %1$@
zh_hans: 修改时间：%1$@

# clipboard.name
source: Name: %1$@
zh_hans: 名称：%1$@

# clipboard.path
source: Path: %1$@
zh_hans: 路径：%1$@

# clipboard.size.bytes
source: Size: %1$@ bytes
zh_hans: 大小：%1$@ bytes

# clipboard.type
source: Type: %1$@
zh_hans: 类型：%1$@

# command.batch.rename
source: Batch Rename
zh_hans: 批量重命名

# command.batch.rename.undone
source: Batch rename undone
zh_hans: 已撤销批量重命名

# command.checksum.copied
source: Checksum copied
zh_hans: 哈希已复制

# command.clipboardFailed
source: Could not write to the system clipboard
zh_hans: 写入系统剪贴板失败

# command.color.value.copied
source: Color value copied
zh_hans: 颜色值已复制

# command.compress.files
source: Compress Files
zh_hans: 压缩文件

# command.content.copied
source: Content copied
zh_hans: 内容已复制

# command.convert.image
source: Convert Image
zh_hans: 转换图片

# command.copied
source: %1$@ copied
zh_hans: %1$@ 已复制

# command.copy.checksum
source: Copy Checksum
zh_hans: 复制哈希

# command.copy.file.info
source: Copy File Info
zh_hans: 复制文件信息

# command.copy.folder
source: Copy to Folder
zh_hans: 复制到目录

# command.copy.path
source: Copy Path
zh_hans: 复制路径

# command.destination.selection.cancelled.user
source: Destination selection cancelled by user
zh_hans: 用户取消选择目标目录

# command.extension.local.information
source: Extension Local Information
zh_hans: 扩展本地信息

# command.extract.icon
source: Extract Icon
zh_hans: 提取图标

# command.file.information.copied
source: File information copied
zh_hans: 文件信息已复制

# command.filename.copied
source: Filename copied
zh_hans: 文件名已复制

# command.finder.action.failed
source: Finder action failed
zh_hans: Finder 动作失败

# command.flatten.folder
source: Flatten Folder
zh_hans: 解除文件夹

# command.groupInFolder
source: Move into Folder
zh_hans: 移入文件夹

# command.hide.other.files
source: Hide Other Files
zh_hans: 隐藏其他文件

# command.hide.unhide.files
source: Hide / Unhide Files
zh_hans: 隐藏/取消隐藏文件

# command.lock.unlock.files
source: Lock / Unlock Files
zh_hans: 锁定/解锁文件

# command.moveToFolder
source: Move to Folder
zh_hans: 移动到目录

# command.open.app
source: Open With App
zh_hans: 用 App 打开

# command.open.path
source: Open Path
zh_hans: 打开路径

# command.open.terminal
source: Open Terminal
zh_hans: 打开终端

# command.path.copied
source: Path copied
zh_hans: 路径已复制

# command.permanently.delete.files
source: Permanently Delete Files
zh_hans: 彻底删除文件

# command.pick.color
source: Pick Color
zh_hans: 拾取颜色

# command.restore.folder.icon
source: Restore Folder Icon
zh_hans: 还原文件夹图标

# command.run.script
source: Run Script
zh_hans: 执行脚本

# command.set.folder.icon
source: Set Folder Icon
zh_hans: 设置文件夹图标

# command.undoRenameFailed
source: Cannot undo batch rename
zh_hans: 无法撤销批量重命名

# command.written.system.clipboard.ready
source: Written to the system clipboard and ready to paste
zh_hans: 已写入系统剪贴板，可以直接粘贴使用

# dispatch.favorite.folder.target.expired.reopen.context
source: Favorite folder target expired. Reopen the context menu.
zh_hans: 常用目录目标已失效，请重新打开右键菜单

# dispatch.finder.context.menu.enhancement.off
source: Finder context menu enhancement is off
zh_hans: Finder 右键增强已关闭

# dispatch.high.risk.actions.off.reopen
source: High-risk actions are off. Reopen the context menu.
zh_hans: 高风险操作已关闭，请重新打开右键菜单

# dispatch.off.reopen.context.menu
source: %1$@ is off. Reopen the context menu.
zh_hans: %1$@已关闭，请重新打开右键菜单

# dispatch.selected.entry.disabled.changed
source: The selected entry was disabled or changed. Reopen the context menu.
zh_hans: 所选条目已停用或变更，请重新打开右键菜单

# execution.actionable.finder.selection.missing
source: No actionable Finder selection.
zh_hans: 没有可操作的 Finder 选中项。

# execution.app.missing.install.retry
source: App not found: %1$@. Install it and retry, or remove this entry in Arc Kit settings.
zh_hans: 未找到应用：%1$@。请安装后重试，或在 Arc Kit 设置中移除此项。

# execution.command.failed
source: Command failed: %1$@
zh_hans: 命令执行失败：%1$@

# execution.currentFolderMissing
source: Could not resolve Finder's current folder: %1$@
zh_hans: 解析 Finder 当前目录失败：%1$@

# execution.favorite.app.configuration.missing
source: Favorite app configuration not found: %1$@
zh_hans: 未找到常用 App 配置：%1$@

# execution.imageReadFailed
source: Cannot read image: %1$@
zh_hans: 无法读取图片：%1$@

# execution.interrupted.completed.items.preserved
source: %1$@ interrupted: %2$@. Completed items (%3$@) are preserved at: %4$@
zh_hans: %1$@中断：%2$@。已完成的 %3$@ 项保留在：%4$@

# execution.output.file.missing.empty
source: Output file is missing or empty: %1$@
zh_hans: 输出文件未生成或为空：%1$@

# execution.required.parameter.missing
source: Required parameter missing: %1$@
zh_hans: 缺少必要参数：%1$@

# execution.targetMissing
source: Cannot determine the target folder for %1$@. Close the menu and right-click an empty area in the target folder or a single item.
zh_hans: 无法获取%1$@的目标目录。请关闭菜单，在目标文件夹空白处或单个项目上重新右键。

# execution.unconfirmed
source: Operation did not take effect: %1$@
zh_hans: 操作未生效：%1$@

# execution.unsupportedImage
source: Unsupported image format: %1$@
zh_hans: 不支持的图片格式：%1$@

# execution.user.confirmation.missing.execution.denied
source: User confirmation missing. Execution denied: %1$@
zh_hans: 缺少用户确认，已拒绝执行：%1$@

# feedback.renamed.items.undo.now
source: Renamed %1$@ items. You can undo now to restore original names.
zh_hans: 已重命名 %1$@ 项。可以立即撤销并恢复原名称。

# feedback.run.batch.rename.again.undo.immediately
source: Run batch rename again, then undo immediately
zh_hans: 请重新执行批量重命名后立即撤销

# feedback.undo.expired
source: Undo expired
zh_hans: 撤销已过期

# feedback.undo.now.restore.original.names
source: Undo now to restore the original names if needed
zh_hans: 如结果不符合预期，可立即恢复原名称

# feedback.undo.unavailable
source: Undo unavailable
zh_hans: 无法提供撤销

# feedback.undoControlFailed
source: Could not initialize undo control
zh_hans: 撤销控件初始化失败

# file.batch.rename.cancelled
source: Batch rename cancelled
zh_hans: 已取消批量重命名

# file.completed
source: %1$@ completed: %2$@ items
zh_hans: 已%1$@ %2$@ 项

# file.completedWithDestination
source: %1$@ completed: %2$@ items to %3$@
zh_hans: 已%1$@ %2$@ 项到 %3$@

# file.destination
source: Destination: %1$@
zh_hans: 目标位置：%1$@

# file.destination.folder.selected.missing
source: No destination folder selected for %1$@
zh_hans: %1$@命令尚未选择目标目录

# file.file.executor.received.unexpected.command
source: File executor received an unexpected command: %1$@
zh_hans: 文件操作执行器收到错误命令：%1$@

# file.files.compressed
source: Files compressed
zh_hans: 已压缩文件

# file.flagUnconfirmed
source: File flag did not take effect: %1$@
zh_hans: 文件标记未生效：%1$@

# file.folder.flattened
source: Folder flattened
zh_hans: 已解除文件夹

# file.moved.folder
source: Moved into folder
zh_hans: 已移入文件夹

# file.source.item.still.exists
source: Source item still exists after %1$@: %2$@
zh_hans: %1$@后源项目仍存在：%2$@

# folderIcon.choose.image.folder.icon
source: Choose an Image for the Folder Icon
zh_hans: 选择要用作文件夹图标的图片

# folderIcon.set.icon
source: Set as Icon
zh_hans: 设置为图标

# image.folder.icon.change.cancelled
source: Folder icon change cancelled
zh_hans: 已取消设置文件夹图标

# image.folder.icons.require.real.folders
source: Folder icons require real folders: %1$@
zh_hans: 文件夹图标只支持真实文件夹：%1$@

# image.icon.extracted
source: Icon extracted
zh_hans: 已提取图标

# image.iconReadbackFailed
source: Cannot read back folder icon state: %1$@
zh_hans: 无法回读文件夹图标状态：%1$@

# image.image.conversion
source: Image Conversion
zh_hans: 图片转换

# image.image.icon.executor.received.unexpected
source: Image and icon executor received an unexpected command: %1$@
zh_hans: 图片与图标执行器收到错误命令：%1$@

# image.unconfirmed
source: %1$@ did not take effect: %2$@
zh_hans: %1$@未生效：%2$@

# images.convertedCount
source: Converted %lld images
zh_hans: 已转换 %lld 张图片

# menu.copy.filename
source: Copy filename
zh_hans: 复制文件名

# menu.delete.permanently
source: Delete Permanently
zh_hans: 彻底删除

# newFile.destinationNotWritable
source: Arc Kit cannot write to this folder: %1$@
zh_hans: Arc Kit 没有权限写入该目录：%1$@

# newFile.invalidDestination
source: Destination is not a folder: %1$@
zh_hans: 目标位置不是文件夹：%1$@

# newFile.newFile.executor.received.unexpected.command
source: New file executor received an unexpected command: %1$@
zh_hans: 新建文件执行器收到错误命令：%1$@

# newFile.newFile.template.missing
source: New file template not found: %1$@
zh_hans: 未找到新建文件模板：%1$@

# newFile.protectedDestination
source: Creating .%1$@ files is not supported. Arc Kit will not create invalid placeholder files.
zh_hans: 暂不支持创建 .%1$@ 文件。Arc Kit 不会创建打不开的假文件。

# newFile.template.source.missing.unreadable.choose
source: Template source is missing or unreadable: %1$@. Choose the template file again in Arc Kit settings.
zh_hans: 模板源文件缺失或不可读：%1$@。请在 Arc Kit 设置中重新选择模板文件。

# open.open.executor.received.unexpected.command
source: Open executor received an unexpected command: %1$@
zh_hans: 打开执行器收到错误命令：%1$@

# open.select.one.terminal.folder.file
source: Select one terminal folder or file
zh_hans: 请选择单个终端目录或文件

# organize.folderCreationFailed
source: Cannot create folder; the name may be taken: %1$@
zh_hans: 无法新建文件夹，名称可能已被占用：%1$@

# organize.invalid.target.folder.name
source: Invalid target folder name
zh_hans: 目标文件夹名称无效

# organize.regularFolderRequired
source: Only regular folders can be flattened, not apps, document packages or symlinks: %1$@
zh_hans: 只能解除普通文件夹，不能解除应用、文档包或符号链接：%1$@

# organize.target.folder.preserved.inspection
source: Target folder preserved for inspection: %1$@
zh_hans: 目标目录保留待检查：%1$@

# output.available.output.names.missing
source: No available output names: %1$@
zh_hans: 输出名称已耗尽：%1$@

# page.newFile
source: New File
zh_hans: 新建文件

# rename.add.prefix
source: Add Prefix
zh_hans: 添加前缀

# rename.add.suffix
source: Add Suffix
zh_hans: 添加后缀

# rename.completedCount
source: Renamed %lld items
zh_hans: 已重命名 %lld 项

# rename.execution.file.identity.verification.undo.failed
source: File identity verification failed after undo: %1$@
zh_hans: 撤销后文件身份校验失败：%1$@

# rename.execution.identityReadFailed
source: Cannot read file identity: %1$@
zh_hans: 无法读取文件身份：%1$@

# rename.execution.nameVerificationFailed
source: Cannot verify destination name %1$@
zh_hans: 无法验证目标名称 %1$@

# rename.execution.temporaryNameFailed
source: Cannot create a safe temporary name
zh_hans: 无法创建安全的临时名称

# rename.prompt.base.name
source: Base name
zh_hans: 基础名称

# rename.prompt.example.archive
source: For example: -Archive
zh_hans: 例如：-归档

# rename.prompt.example.photo
source: For example: Photo
zh_hans: 例如：照片

# rename.prompt.example.project
source: For example: Project-
zh_hans: 例如：项目-

# rename.prompt.find
source: Find
zh_hans: 查找

# rename.prompt.invalid.rename.rule
source: Invalid rename rule
zh_hans: 重命名规则无效

# rename.prompt.items.rename.naturally.sorted.current
source: Items to rename: %1$@, naturally sorted by current name
zh_hans: 将修改 %1$@ 项；按当前名称自然排序

# rename.prompt.leave.empty.remove
source: Leave empty to remove
zh_hans: 可留空以删除

# rename.prompt.number.width
source: Number width
zh_hans: 编号位数

# rename.prompt.plus.more
source: …plus %1$@ more
zh_hans: …另外 %1$@ 项

# rename.prompt.preserve.file.extensions
source: Preserve file extensions
zh_hans: 保留文件扩展名

# rename.prompt.primary.text
source: Primary text
zh_hans: 主要文字

# rename.prompt.rename
source: Rename
zh_hans: 重命名

# rename.prompt.rename.method
source: Rename method
zh_hans: 重命名方式

# rename.prompt.rename.preview
source: Rename Preview
zh_hans: 重命名预览

# rename.prompt.replace
source: Replace with
zh_hans: 替换为

# rename.prompt.replacement.text.starting.number
source: Replacement text or starting number
zh_hans: 替换文字或起始编号

# rename.prompt.review.preview.below.arcKit.preserves
source: Review the preview below. Arc Kit preserves extensions, rejects name conflicts and restores original names if execution fails.
zh_hans: 先确认下方预览。Arc Kit 会保留扩展名、拒绝重名，并在执行失败时恢复原名称。

# rename.prompt.starting.number
source: Starting number
zh_hans: 起始编号

# rename.prompt.text.replace
source: Text to replace
zh_hans: 要替换的文字

# rename.restoredCount
source: Restored %lld original names
zh_hans: 已恢复 %lld 项原名称

# rename.selectionCount
source: Rename %lld Items
zh_hans: 批量重命名 %lld 项

# script.execution.script.execution.failed
source: Script execution failed: %1$@
zh_hans: 脚本执行失败：%1$@

# script.execution.unexpectedCommand
source: Script executor received an unexpected command: %1$@
zh_hans: 脚本执行器收到错误命令：%1$@

# selection.all.selected.items
source: All selected items must be in the same folder
zh_hans: 此操作只允许同一目录内的选中项

# server.finder.extension.identity.verification.failed
source: Finder extension identity verification failed
zh_hans: Finder 扩展身份验证失败

# server.finder.request.expired
source: Finder request expired
zh_hans: Finder 请求已过期

# server.invalid.finder.extension.runtime.data
source: Invalid Finder extension runtime data: %1$@
zh_hans: Finder 扩展运行态数据无效：%1$@

# server.too.many.finder.requests.retry.later
source: Too many Finder requests. Try again later.
zh_hans: Finder 请求过多，请稍后重试

# system.items.open.missing
source: No items to open
zh_hans: 没有可打开的项目

# system.resultUnconfirmed
source: %1$@: macOS has not confirmed the result. Check the target app first.
zh_hans: %1$@：系统尚未确认打开结果，请先检查目标应用

# system.system.returned.target.app.missing
source: The system returned no target app
zh_hans: 系统没有返回目标应用

# target.action.supports.one.item
source: This action supports one item only
zh_hans: 此操作只支持一个项目

# target.notDirectory
source: Resolved location is not a folder: %1$@
zh_hans: 解析到的位置不是文件夹：%1$@

# terminal.authorizationDenied
source: Not authorized to control %1$@. In System Settings → Privacy & Security → Automation, allow Arc Kit / Arc Kit Runtime Host to control this terminal, then retry. Opening a folder normally does not need this permission.
zh_hans: 未获准控制 %1$@。请在系统设置「隐私与安全性 → 自动化」允许 Arc Kit / Arc Kit Runtime Host 控制该终端，再重试此操作。普通打开目录不需要此授权。

# terminal.scriptCreationFailed
source: Cannot create terminal script
zh_hans: 无法创建终端脚本

# terminal.terminal.automation.failed
source: Terminal automation failed
zh_hans: 终端自动化执行失败

# terminal.unsupportedAction
source: This terminal does not support this creation mode. Reopen the menu and choose New Window.
zh_hans: 该终端不支持此新建方式，请重新打开菜单选择新建窗口

# transfer.duplicate.selected.item
source: Duplicate selected item: %1$@
zh_hans: 选中项重复：%1$@

# transfer.execution.copyRollbackUnconfirmed
source: Copy rollback did not take effect: %1$@
zh_hans: 复制回滚未生效：%1$@

# transfer.execution.destination.occupied
source: Destination is occupied: %1$@
zh_hans: 目标位置已被占用：%1$@

# transfer.execution.destinationMissing
source: Destination item was not created: %1$@
zh_hans: 目标项目未生成：%1$@

# transfer.execution.folder.backup
source: %1$@: %2$@; folder backup: %3$@
zh_hans: %1$@：%2$@；目录备份：%3$@

# transfer.execution.move.rollback.location.changed
source: Move rollback location changed: %1$@ ← %2$@
zh_hans: 移动回滚位置已变化：%1$@ ← %2$@

# transfer.execution.moveRollbackUnconfirmed
source: Move rollback did not take effect: %1$@
zh_hans: 移动回滚未生效：%1$@

# transfer.execution.new.items.appeared.folder.flattening
source: New items appeared in the folder. Flattening stopped: %1$@
zh_hans: 目录出现新项目，停止解除：%1$@

# transfer.execution.original.folder.location.occupied
source: Original folder location is occupied: %1$@
zh_hans: 原文件夹位置已被占用：%1$@

# transfer.execution.source.folder.still.exists
source: Source folder still exists: %1$@
zh_hans: 源文件夹仍存在：%1$@

# transfer.execution.source.item.missing.copying
source: Source item missing after copying: %1$@
zh_hans: 复制后源项目丢失：%1$@

# transfer.execution.source.item.still.exists.moving
source: Source item still exists after moving: %1$@
zh_hans: 移动后源项目仍存在：%1$@

# transfer.execution.sourceDeletionRejected
source: A copy operation cannot delete the source folder
zh_hans: 复制操作不能删除源文件夹

# transfer.execution.sourceMissing
source: Source item is missing. Destination copy preserved: %1$@
zh_hans: 源项目已丢失，保留目标副本：%1$@

# transfer.execution.step.s.result.uncertain.failed
source: The failed step's result is uncertain. Check: %1$@ → %2$@
zh_hans: 失败步骤结果不确定，请检查：%1$@ → %2$@

# transfer.prompt.choose.destination.folder
source: Choose the destination folder for %1$@
zh_hans: 选择所选项目的%1$@目标文件夹

# transfer.prompt.choose.location
source: Choose %1$@ Location
zh_hans: 选择%1$@位置

# worker.connection.encodeFailed
source: Cannot encode request: %1$@
zh_hans: 无法编码请求：%1$@

# worker.connection.error.output.provided.missing
source: No error output provided
zh_hans: 未提供错误输出

# worker.input.rejected
source: Finder Worker rejected oversized or unreadable input.
zh_hans: Finder Worker 拒绝超出上限或不可读的输入。

# worker.protocol.another.finder.operation.running.wait
source: Another Finder operation is running. Wait for it to finish.
zh_hans: 正在执行另一个 Finder 操作，请完成后重试

# worker.protocol.finder.action.timeout.isolated.worker
source: Finder action timed out. The isolated Worker was terminated.
zh_hans: Finder 动作执行超时，已终止独立 Worker

# worker.protocol.finder.worker.executable.missing
source: Finder Worker executable not found
zh_hans: Finder Worker 可执行文件不存在

# worker.protocol.finder.worker.exited.unexpectedly
source: Finder Worker exited unexpectedly (%1$@): %2$@
zh_hans: Finder Worker 异常退出（%1$@）：%2$@

# worker.protocol.finder.worker.request.exceeds.size.limit
source: Finder Worker request exceeds the size limit
zh_hans: Finder Worker 请求超过大小上限

# worker.protocol.finder.worker.request.expired
source: Finder Worker request expired
zh_hans: Finder Worker 请求已过期

# worker.protocol.finder.worker.returned.damaged.response
source: Finder Worker returned a damaged response
zh_hans: Finder Worker 返回了损坏的响应

# worker.protocol.finder.worker.start.failed
source: Finder Worker failed to start: %1$@
zh_hans: Finder Worker 启动失败：%1$@

# worker.protocol.operationRejected
source: Finder Worker rejected a disallowed operation
zh_hans: Finder Worker 拒绝了不允许的操作

# worker.protocol.pipeNotClosed
source: Finder Worker output pipe did not close. Stopped waiting; check subprocesses launched by the script.
zh_hans: Finder Worker 输出管道未关闭，已停止等待；请检查脚本启动的子进程

# worker.protocol.responseMismatch
source: Finder Worker response does not match the current request
zh_hans: Finder Worker 响应与当前请求不匹配

# worker.protocol.responseTooLarge
source: Finder Worker response exceeds the size limit
zh_hans: Finder Worker 响应超过大小上限

# worker.protocol.versionMismatch
source: Finder Worker protocol mismatch: expected %1$@, actual %2$@
zh_hans: Finder Worker 协议不一致：期望 %1$@，实际 %2$@
